Revit 2021.1 API
FormatOptions.IsValidUnitSymbol Method (UnitSymbolType)
 Checks whether a unit symbol is valid for the display unit in this FormatOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 21.0.0.0 (21.1.1.109)
Since: 2014
Syntax
C#
[ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `IsValidSymbol(ForgeTypeId)` method instead.")]
public bool IsValidUnitSymbol(
	UnitSymbolType unitSymbol
)
Visual Basic
<ObsoleteAttribute("This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `IsValidSymbol(ForgeTypeId)` method instead.")> _
Public Function IsValidUnitSymbol ( _
	unitSymbol As UnitSymbolType _
) As Boolean
Visual C++
[ObsoleteAttribute(L"This method is deprecated in Revit 2021 and may be removed in a future version of Revit. Please use the `IsValidSymbol(ForgeTypeId)` method instead.")]
public:
bool IsValidUnitSymbol(
	UnitSymbolType unitSymbol
)
Parameters
unitSymbol
Type: Autodesk.Revit.DB.UnitSymbolType
 The unit symbol to check.
Return Value
 True if the unit symbol is valid, false otherwise.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
Autodesk.Revit.Exceptions.InvalidOperationException |  UseDefault is true in this FormatOptions.
See Also
FormatOptions Class
IsValidUnitSymbol Overload
Autodesk.Revit.DB Namespace